## Grouping

In [20]:
import pandas as pd

### 1) 뉴욕 airBnB 데이터

#### Question 44

데이터를 로드하고 상위 5개 컬럼을 출력하라

In [21]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/AB_NYC_2019.csv')
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [22]:
len(df)

48895

#### Question 45 (V)

데이터의 각 host_name의 빈도수를 구하고 host_name으로 정렬하여 상위 5개를 출력하라

In [23]:
# 정답
Ans = df.groupby('host_name').size()

# or

Ans = df.host_name.value_counts().sort_index()

#### Question 46

데이터의 각 host_name의 빈도수를 구하고 빈도수 기준 내림차순 정렬한 데이터 프레임을 만들어라. 빈도수 컬럼은 counts로 명명하라

In [24]:
df.host_name

0                 John
1             Jennifer
2            Elisabeth
3          LisaRoxanne
4                Laura
             ...
48890          Sabrina
48891          Marisol
48892    Ilgar & Aysel
48893              Taz
48894       Christophe
Name: host_name, Length: 48895, dtype: object

In [25]:
df.host_name.value_counts().sort_values(ascending=False)

host_name
Michael             417
David               403
Sonder (NYC)        327
John                294
Alex                279
                   ...
Martin & Soledad      1
Soheil                1
Keno                  1
Keagon                1
Ilgar & Aysel         1
Name: count, Length: 11452, dtype: int64

In [26]:
# 정답
Ans = df.groupby('host_name').size().\
                to_frame().rename(columns={0:'counts'}).\
                sort_values('counts',ascending=False)

#### Question 47 (V)

neighbourhood_group의 값에 따른 neighbourhood컬럼 값의 갯수를 구하여라

In [27]:
Ans = df.groupby(['neighbourhood_group','neighbourhood'], as_index=False).size()
Ans

    neighbourhood_group  neighbourhood  size
0                 Bronx       Allerton    42
1                 Bronx     Baychester     7
2                 Bronx        Belmont    24
3                 Bronx      Bronxdale    19
4                 Bronx    Castle Hill     9
..                  ...            ...   ...
216       Staten Island    Tottenville     7
217       Staten Island  West Brighton    18
218       Staten Island    Westerleigh     2
219       Staten Island    Willowbrook     1
220       Staten Island        Woodrow     1

[221 rows x 3 columns]

#### Question 48 (V)

neighbourhood_group의 값에 따른 neighbourhood컬럼 값 중 neighbourhood_group그룹의 최댓값들을 출력하라

In [28]:
Ans= df.groupby(['neighbourhood_group','neighbourhood'], as_index=False).size()\
                  .groupby(['neighbourhood_group'], as_index=False).max()
Ans

  neighbourhood_group    neighbourhood  size
0               Bronx         Woodlawn    70
1            Brooklyn  Windsor Terrace  3920
2           Manhattan     West Village  2658
3              Queens         Woodside   900
4       Staten Island          Woodrow    48

#### Question 49

neighbourhood_group 값에 따른 price값의 평균, 분산, 최대, 최소 값을 구하여라

In [29]:
# 정답
Ans = df[['neighbourhood_group','price']].groupby('neighbourhood_group').agg(['mean','var','max','min'])
Ans

                          price
                           mean           var    max min
neighbourhood_group
Bronx                 87.496792  11386.885081   2500   0
Brooklyn             124.383207  34921.719135  10000   0
Manhattan            196.875814  84904.159185  10000   0
Queens                99.517649  27923.130227  10000  10
Staten Island        114.812332  77073.088342   5000  13

In [30]:
df['price'].groupby(df['neighbourhood_group']).mean()

neighbourhood_group
Bronx             87.496792
Brooklyn         124.383207
Manhattan        196.875814
Queens            99.517649
Staten Island    114.812332
Name: price, dtype: float64

In [31]:
df['price'].groupby(df['neighbourhood_group']).var()

neighbourhood_group
Bronx            11386.885081
Brooklyn         34921.719135
Manhattan        84904.159185
Queens           27923.130227
Staten Island    77073.088342
Name: price, dtype: float64

In [32]:
df['price'].groupby(df['neighbourhood_group']).max()

neighbourhood_group
Bronx             2500
Brooklyn         10000
Manhattan        10000
Queens           10000
Staten Island     5000
Name: price, dtype: int64

In [33]:
df['price'].groupby(df['neighbourhood_group']).min()

neighbourhood_group
Bronx             0
Brooklyn          0
Manhattan         0
Queens           10
Staten Island    13
Name: price, dtype: int64

#### Question 50

neighbourhood_group 값에 따른 reviews_per_month 평균, 분산, 최대, 최소 값을 구하여라

In [34]:
# 정답
Ans = df[['neighbourhood_group','reviews_per_month']].groupby('neighbourhood_group').agg(['mean','var','max','min'])

In [35]:
df['reviews_per_month'].groupby(df['neighbourhood_group']).mean()

neighbourhood_group
Bronx            1.837831
Brooklyn         1.283212
Manhattan        1.272131
Queens           1.941200
Staten Island    1.872580
Name: reviews_per_month, dtype: float64

In [36]:
df['reviews_per_month'].groupby(df['neighbourhood_group']).var()

neighbourhood_group
Bronx            2.799878
Brooklyn         2.299040
Manhattan        2.651206
Queens           4.897848
Staten Island    2.840895
Name: reviews_per_month, dtype: float64

In [37]:
df['reviews_per_month'].groupby(df['neighbourhood_group']).max()

neighbourhood_group
Bronx            10.34
Brooklyn         14.00
Manhattan        58.50
Queens           20.94
Staten Island    10.12
Name: reviews_per_month, dtype: float64

In [38]:
df['reviews_per_month'].groupby(df['neighbourhood_group']).min()

neighbourhood_group
Bronx            0.02
Brooklyn         0.01
Manhattan        0.01
Queens           0.01
Staten Island    0.02
Name: reviews_per_month, dtype: float64